app/controllers/offlearns_controller.rb

SELECT * FROM "offlearns" WHERE ("offlearns"."id" = 0)
---
  def show
    @offlearn = Offlearn.find(params[:id])